In [1]:
import pandas as pd

In [2]:
ds=pd.read_csv('ds/homeprices.csv')

In [3]:
ds

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   area      6 non-null      int64
 1   bedrooms  5 non-null      float64
 2   age       6 non-null      int64
 3   price     6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

In [8]:
import math

In [9]:
bm=math.floor(ds['bedrooms'].median())

In [10]:
bm

4

In [12]:
ds['bedrooms']=ds['bedrooms'].fillna(bm)

In [13]:
ds

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [15]:
from sklearn.linear_model import LinearRegression

In [16]:
r=LinearRegression()

In [17]:
x=ds.drop('price',axis=1)

In [18]:
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [19]:
y=ds['price']

In [20]:
r.fit(x,y)

LinearRegression()

In [21]:
r.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [23]:
r.predict([[3300,5.0,10]])

C:\Users\Arun\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([675756.28157781])